In [2]:
import pandas as pd

In [3]:
#Series de pandas
numeros=[1,2,3,4,5,6,7,8,9]
serie=pd.Series(numeros)
serie, type(serie)

(0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 6    7
 7    8
 8    9
 dtype: int64,
 pandas.core.series.Series)

In [4]:
#Dataframe de pandas
#Es una estructura de datos bidimensional con columnas de diferentes tipos, similar a una hoja de cálculo o una tabla SQL.
diccionario = {"Nombre":["Juan","Ana","Jose","Arturo"],"Edad":[25,18,23,27],"Ciudad":["Barcelona","Madrid","Bilbao","Valencia"]}

#Creación de un dataframe a partir de un diccionario
df =  pd.DataFrame(diccionario)
df

   Nombre  Edad     Ciudad
0    Juan    25  Barcelona
1     Ana    18     Madrid
2    Jose    23     Bilbao
3  Arturo    27   Valencia

In [5]:
#Exportar DataFramed
df.to_csv("data.csv")

In [8]:
#Importar DataFramed
imported_df = pd.read_csv("data.csv",index_col=0)
imported_df

   Nombre  Edad     Ciudad
0    Juan    25  Barcelona
1     Ana    18     Madrid
2    Jose    23     Bilbao
3  Arturo    27   Valencia

In [10]:
#Seleccionar columnas
nombres = df['Nombre']
nombres

0      Juan
1       Ana
2      Jose
3    Arturo
Name: Nombre, dtype: object

In [11]:
#Seleccionar una o mas columnas
df[['Nombre','Edad']]

   Nombre  Edad
0    Juan    25
1     Ana    18
2    Jose    23
3  Arturo    27

In [13]:
#Filtrar por filas
fila = df.loc[0]
fila

Nombre         Juan
Edad             25
Ciudad    Barcelona
Name: 0, dtype: object

In [14]:
#Filtrar por condiciones
df[df['Edad']>20]

   Nombre  Edad     Ciudad
0    Juan    25  Barcelona
2    Jose    23     Bilbao
3  Arturo    27   Valencia

In [16]:
filtro = (df["Edad"]>23) & (df["Nombre"].str.startswith("A"))
df[filtro]

   Nombre  Edad    Ciudad
3  Arturo    27  Valencia

In [17]:
#Filtrar por querys
df.query('Edad>20')

   Nombre  Edad     Ciudad
0    Juan    25  Barcelona
2    Jose    23     Bilbao
3  Arturo    27   Valencia

In [18]:
df[df["Nombre"].isin(["Juan","Ana"])]

  Nombre  Edad     Ciudad
0   Juan    25  Barcelona
1    Ana    18     Madrid

In [20]:
def nombre_con_4_letras(nombre):
    return len(nombre)==4

df[df["Nombre"].apply(nombre_con_4_letras)]

  Nombre  Edad     Ciudad
0   Juan    25  Barcelona
2   Jose    23     Bilbao

In [22]:
#Filtrar por endades entre 35 y 25
df[df["Edad"].between(25,25)]

  Nombre  Edad     Ciudad
0   Juan    25  Barcelona